storage/tests/2f8038e2-187f-4e44-b13a-4db0018d4508/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/2f8038e2-187f-4e44-b13a-4db0018d4508/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 40s max duration (incl. graceful stop):
              * default: 5 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 5 VUs  01.0s/10s

running (02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 5 VUs  02.0s/10s

running (03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 5 VUs  03.0s/10s

running (04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 5 VUs  04.0s/10s

running (05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 5 VUs  05.0s/10s

running (06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 5 VUs  06.0s/10s

running (07.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 5 VUs  07.0s/10s

running (08.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 5 VUs  08.0s/10s

running (09.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 5 VUs  09.0s/10s

running (10.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 5 VUs  10.0s/10s

running (11.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (12.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (13.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (14.0s), 3/5 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (15.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s

running (16.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 5 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 30      1.822592/s
    checks_succeeded...: 100.00% 30 out of 30
    checks_failed......: 0.00%   0 out of 30

    ✓ status ok

    HTTP
    http_req_duration..............: avg=121.61ms min=4.44ms med=7.72ms max=564.62ms p(90)=357.37ms p(95)=362.15ms
      { expected_response:true }...: avg=121.61ms min=4.44ms med=7.72ms max=564.62ms p(90)=357.37ms p(95)=362.15ms
    http_req_failed................: 0.00%  0 out of 30
    http_reqs......................: 30     1.822592/s

    EXECUTION
    iteration_duration.............: avg=14.62s   min=13.52s med=14.5s  max=16.45s   p(90)=15.74s   p(95)=16.1s   
    iterations.....................: 5      0.303765/s
    vus............................: 1      min=1       max=5
    vus_max........................: 5      min=5       max=5

    NETWORK
    data_received..................: 12 kB  744 B/s
    data_sent......................: 9.2 kB 560 B/s



running (16.5s), 0/5 VUs, 5 complete and 0 interrupted iterations
default ✓ [ 100% ] 5 VUs  10s